app/controllers/api/todos_controller.rb

INSERT INTO "todos" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Get over it"], ["body", "its so hard but worth it"], ["created_at", "2016-04-19 21:21:09.347747"], ["updated_at", "2016-04-19 21:21:09.347747"]]
---
  def create
    render json: Todo.create!(todo_params)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "todos" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Grow up"], ["body", "but i dont want to"], ["updated_at", "2016-04-19 21:23:12.105918"], ["id", 3]]
---
  def update
    todo = Todo.find(params[:id])
    todo.done = todo.done ? false : true
    todo.save!

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 3]]
---
  def destroy
    todo = Todo.find(params[:id])
    todo.destroy!

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    todo = Todo.find(params[:id])